In [1]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
dataset = pd.read_excel('C:/Users/dasar.SELVAMDG/Desktop/p/Data_Preprocessing/dataset/Employee_Data.xls')

In [3]:
os.getcwd()

'C:\\Users\\dasar.SELVAMDG\\Desktop\\p\\Data_Preprocessing'

In [4]:
dataset.head()

,Employee Id,First Name,Last Name,Department,Age,Experience,Salary
0,1,Joy,Bass,Sales and Marketing,28.0,3.0,32889
1,2,Sheila,Garza,Sales and Marketing,22.0,1.0,15944
2,3,John,Bryant,Customer Relations,22.0,1.0,40343
3,4,Christian,Farley,Customer Relations,22.0,1.0,19018
4,5,Colorado,Bowen,Accounting,27.0,0.0,24795

In [5]:
dataset.isnull().sum()

Employee Id     0
First Name      0
Last Name       0
Department     19
Age            18
Experience     10
Salary          0
dtype: int64

In [6]:
dataset.describe()

       Employee Id        Age  Experience        Salary
count   100.000000  82.000000   90.000000    100.000000
mean     50.500000  37.975610   14.766667  65066.760000
std      29.011492   9.515388    6.889252  26189.874212
min       1.000000  22.000000    0.000000  11830.000000
25%      25.750000  27.250000    9.250000  48526.000000
50%      50.500000  42.000000   16.500000  73500.500000
75%      75.250000  45.750000   21.000000  86621.250000
max     100.000000  50.000000   25.000000  98180.000000

In [7]:
dataset.shape

(100, 7)

In [8]:
dataset.columns

Index(['Employee Id', 'First Name', 'Last Name', 'Department', 'Age',
       'Experience', 'Salary'],
      dtype='object')

In [44]:
x = dataset.iloc[:,3:6].values
x

array([['Sales and Marketing', 28.0, 3.0],
       ['Sales and Marketing', 22.0, 1.0],
       ['Customer Relations', 22.0, 1.0],
       ['Customer Relations', 22.0, 1.0],
       ['Accounting', 27.0, 0.0],
       ['Accounting', 26.0, 5.0],
       ['Customer Relations', 24.0, 6.0],
       ['Customer Relations', 29.0, 2.0],
       ['Sales and Marketing', 29.0, 5.0],
       ['Customer Relations', 30.0, 6.0],
       ['Accounting', 26.0, 5.0],
       ['Sales and Marketing', 26.0, 6.0],
       ['Accounting', 24.0, 5.0],
       ['Accounting', 22.0, 2.0],
       ['Sales and Marketing', 25.0, 3.0],
       ['Accounting', 25.0, nan],
       ['Customer Relations', 22.0, nan],
       ['Accounting', 25.0, nan],
       ['Accounting', 27.0, nan],
       ['Sales and Marketing', 25.0, nan],
       ['Sales and Marketing', 22.0, nan],
       ['Sales and Marketing', 22.0, nan],
       ['Sales and Marketing', 24.0, nan],
       ['Sales and Marketing', 27.0, nan],
       ['Sales and Marketing', 22.0, nan],
       ['Sales and Marketing', 33.0, 13.0],
       ['Sales and Marketing', 36.0, 7.0],
       ['Sales and Marketing', 35.0, 10.0],
       ['Sales and Marketing', 33.0, 12.0],
       ['Sales and Marketing', 30.0, 14.0],
       ['Sales and Marketing', 40.0, 15.0],
       ['Sales and Marketing', 39.0, 12.0],
       ['Sales and Marketing', nan, 9.0],
       ['Sales and Marketing', nan, 7.0],
       ['Sales and Marketing', nan, 15.0],
       ['Sales and Marketing', nan, 11.0],
       ['Sales and Marketing', nan, 10.0],
       ['Sales and Marketing', nan, 7.0],
       ['Sales and Marketing', nan, 13.0],
       ['Sales and Marketing', nan, 9.0],
       ['Customer Relations', nan, 8.0],
       ['Accounting', nan, 12.0],
       ['Accounting', nan, 9.0],
       ['Sales and Marketing', nan, 12.0],
       ['Sales and Marketing', nan, 15.0],
       ['Customer Relations', nan, 14.0],
       ['Sales and Marketing', nan, 10.0],
       ['Customer Relations', nan, 8.0],
       ['Customer Relations', nan, 12.0],
       ['Customer Relations', nan, 15.0],
       ['Sales and Marketing', 38.0, 14.0],
       ['Accounting', 41.0, 25.0],
       ['Customer Relations', 44.0, 17.0],
       ['Accounting', 41.0, 17.0],
       ['Sales and Marketing', 50.0, 21.0],
       ['Sales and Marketing', 47.0, 19.0],
       ['Accounting', 43.0, 25.0],
       ['Customer Relations', 48.0, 25.0],
       ['Accounting', 46.0, 22.0],
       ['Customer Relations', 44.0, 16.0],
       ['Accounting', 42.0, 21.0],
       ['Sales and Marketing', 44.0, 19.0],
       ['Customer Relations', 49.0, 16.0],
       ['Customer Relations', 44.0, 18.0],
       ['Sales and Marketing', 49.0, 22.0],
       ['Accounting', 44.0, 17.0],
       ['Sales and Marketing', 48.0, 16.0],
       ['Customer Relations', 47.0, 23.0],
       ['Customer Relations', 50.0, 22.0],
       ['Sales and Marketing', 42.0, 19.0],
       ['Accounting', 48.0, 19.0],
       ['Customer Relations', 46.0, 24.0],
       ['Sales and Marketing', 42.0, 23.0],
       ['Sales and Marketing', 45.0, 22.0],
       ['Customer Relations', 48.0, 17.0],
       ['Sales and Marketing', 41.0, 23.0],
       ['Sales and Marketing', 49.0, 19.0],
       ['Sales and Marketing', 41.0, 22.0],
       ['Sales and Marketing', 42.0, 24.0],
       ['Accounting', 41.0, 22.0],
       ['Accounting', 45.0, 21.0],
       ['Customer Relations', 43.0, 16.0],
       ['Accounting', 46.0, 18.0],
       ['Sales and Marketing', 47.0, 20.0],
       ['Accounting', 45.0, 17.0],
       ['Sales and Marketing', 42.0, 17.0],
       ['Sales and Marketing', 44.0, 21.0],
       ['Accounting', 45.0, 19.0],
       ['Accounting', 44.0, 21.0],
       ['Customer Relations', 47.0, 20.0],
       ['Sales and Marketing', 44.0, 19.0],
       ['Accounting', 44.0, 18.0],
       ['Sales and Marketing', 41.0, 17.0],
       ['Accounting', 48.0, 21.0],
       ['Accounting', 48.0, 22.0],
       ['Sales and Marketing', 47.0, 22.0],
       ['Sales and Marketing', 46.0, 20.0],
       ['Customer Relations', 44.0, 18.0],
       ['Customer Relations', 47.0, 22.0],
       ['Accounting', 44.0, 21.0]], dtype=object)

In [49]:
df  = pd.DataFrame(x)
df.head()

                     0     1    2
0  Sales and Marketing  28.0  3.0
1  Sales and Marketing  22.0  1.0
2   Customer Relations  22.0  1.0
3   Customer Relations  22.0  1.0
4           Accounting  27.0  0.0

In [11]:
dataset.isnull().sum()/len(dataset)

Employee Id    0.00
First Name     0.00
Last Name      0.00
Department     0.19
Age            0.18
Experience     0.10
Salary         0.00
dtype: float64

In [12]:
dataset['Department'].value_counts()

Sales and Marketing    30
Accounting             27
Customer Relations     24
Name: Department, dtype: int64

In [13]:
dataset['Department'] = dataset['Department'].fillna('Sales and Marketing')

In [14]:
dataset.isnull().sum()/len(dataset)

Employee Id    0.00
First Name     0.00
Last Name      0.00
Department     0.00
Age            0.18
Experience     0.10
Salary         0.00
dtype: float64

Empty DataFrame
Columns: [Department, Age, Experience]
Index: []

In [45]:
#Automatic Approach

from sklearn.impute import SimpleImputer
impute = SimpleImputer(strategy ="most_frequent")
x[:,0:1] = impute.fit_transform(x[:,0:1])